Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.0.39/edc/PIC32MK0512MCF064.PIC
      <edc:SFRDef edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="nn--nnnnn-nnnnnnnnnnnnnnnnnnnnnn" edc:cname="TraceControl" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="TraceControl" edc:nmmrflags="0a" edc:nmmrid="348" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="On" edc:desc="" edc:mask="0x1" edc:name="On" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="Mode" edc:desc="" edc:mask="0x7" edc:name="Mode" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="G" edc:desc="" edc:mask="0x1" edc:name="G" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ASID" edc:desc="" edc:mask="0xff" edc:name="ASID" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="ASID_M" edc:desc="" edc:mask="0xff" edc:name="ASID_M" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="U" edc:desc="" edc:mask="0x1" edc:name="U" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="K" edc:desc="" edc:mask="0x1" edc:name="K" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="E" edc:desc="" edc:mask="0x1" edc:name="E" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="D" edc:desc="" edc:mask="0x1" edc:name="D" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IO" edc:desc="" edc:mask="0x1" edc:name="IO" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TB" edc:desc="" edc:mask="0x1" edc:name="TB" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="UT" edc:desc="" edc:mask="0x1" edc:name="UT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TS" edc:desc="" edc:mask="0x1" edc:name="TS" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="-------------------------rrrrrrr" edc:cname="TraceControl2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000001001000" edc:name="TraceControl2" edc:nmmrflags="0b" edc:nmmrid="476" edc:nzwidth="0x20" edc:por="00000000000000000000000001001000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SyP" edc:desc="" edc:mask="0x7" edc:name="SyP" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="TBU" edc:desc="" edc:mask="0x1" edc:name="TBU" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TBI" edc:desc="" edc:mask="0x1" edc:name="TBI" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ValidModes" edc:desc="" edc:mask="0x3" edc:name="ValidModes" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="UserTraceData" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="UserTraceData" edc:nmmrflags="0c" edc:nmmrid="604" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="Data" edc:desc="" edc:mask="0xffffffff" edc:name="Data" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="n-------nnnnnnnnn-------nnnnnnnn" edc:cname="TraceBPC" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="TraceBPC" edc:nmmrflags="0d" edc:nmmrid="732" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IBPOn" edc:desc="" edc:mask="0xff" edc:name="IBPOn" edc:nzwidth="0x8"/>
            <edc:AdjustPoint edc:offset="7"/>
            <edc:SFRFieldDef edc:cname="IE" edc:desc="" edc:mask="0x1" edc:name="IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DBPOn" edc:desc="" edc:mask="0xff" edc:name="DBPOn" edc:nzwidth="0x8"/>
            <edc:AdjustPoint edc:offset="7"/>
            <edc:SFRFieldDef edc:cname="DE" edc:desc="" edc:mask="0x1" edc:name="DE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="----------------------------rrrr" edc:cname="Debug2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="Debug2" edc:nmmrflags="0e" edc:nmmrid="860" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PACO" edc:desc="" edc:mask="0x1" edc:name="PACO" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TUP" edc:desc="" edc:mask="0x1" edc:name="TUP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DQ" edc:desc="" edc:mask="0x1" edc:name="DQ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PRM" edc:desc="" edc:mask="0x1" edc:name="PRM" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DEPC" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="DEPC" edc:nmmrflags="0t" edc:nmmrid="224" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DEPC" edc:desc="" edc:mask="0xffffffff" edc:name="DEPC" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="UserTraceData2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="UserTraceData2" edc:nmmrflags="0a" edc:nmmrid="352" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="Data" edc:desc="" edc:mask="0xffffffff" edc:name="Data" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="r------nn-------nnnnnnnnnnnnn-nn" edc:cname="PerfCtl0" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10000000000000000000000000000000" edc:name="PerfCtl0" edc:nmmrflags="0t" edc:nmmrid="228" edc:nzwidth="0x20" edc:por="10000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EXL" edc:desc="" edc:mask="0x1" edc:name="EXL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="K" edc:desc="" edc:mask="0x1" edc:name="K" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="U" edc:desc="" edc:mask="0x1" edc:name="U" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IE" edc:desc="" edc:mask="0x1" edc:name="IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVENT" edc:desc="" edc:mask="0x7f" edc:name="EVENT" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="EVENTEXT" edc:desc="" edc:mask="0xf" edc:name="EVENTEXT" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="8"/>
            <edc:SFRFieldDef edc:cname="EC" edc:desc="" edc:mask="0x3" edc:name="EC" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PerfCnt0" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="PerfCnt0" edc:nmmrflags="0a" edc:nmmrid="356" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="Counter" edc:desc="" edc:mask="0xffffffff" edc:name="Counter" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="r------nn-------nnnnnnnnnnnnn-nn" edc:cname="PerfCtl1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="PerfCtl1" edc:nmmrflags="0b" edc:nmmrid="484" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EXL" edc:desc="" edc:mask="0x1" edc:name="EXL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="K" edc:desc="" edc:mask="0x1" edc:name="K" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="U" edc:desc="" edc:mask="0x1" edc:name="U" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IE" edc:desc="" edc:mask="0x1" edc:name="IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVENT" edc:desc="" edc:mask="0x7f" edc:name="EVENT" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="EVENTEXT" edc:desc="" edc:mask="0xf" edc:name="EVENTEXT" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="8"/>
            <edc:SFRFieldDef edc:cname="EC" edc:desc="" edc:mask="0x3" edc:name="EC" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PerfCnt1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="PerfCnt1" edc:nmmrflags="0c" edc:nmmrid="612" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="Counter" edc:desc="" edc:mask="0xffffffff" edc:name="Counter" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
