Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.0.39/edc/PIC32MK0512MCF064.PIC
      <edc:DCRDef edc:_addr="0x1FC45024" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="DEVSN1" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0xffffffff" edc:isidehidden="true" edc:name="DEVSN1" edc:nzwidth="32" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x00000000">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="SN" edc:desc="" edc:mask="0xffffffff" edc:name="SN" edc:nzwidth="32"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x1FC45028" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="DEVSN2" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0xffffffff" edc:isidehidden="true" edc:name="DEVSN2" edc:nzwidth="32" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x00000000">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="SN" edc:desc="" edc:mask="0xffffffff" edc:name="SN" edc:nzwidth="32"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x1FC4502C" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="DEVSN3" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0xffffffff" edc:isidehidden="true" edc:name="DEVSN3" edc:nzwidth="32" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x00000000">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="SN" edc:desc="" edc:mask="0xffffffff" edc:name="SN" edc:nzwidth="32"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:ConfigFuseSector>
    <edc:ConfigFuseSector edc:beginaddr="0x1fc45030" edc:endaddr="0x1fc45040" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:regionid="eedatacal">
      <edc:DCRDef edc:_addr="0x1FC45030" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DEVEE0" edc:default="0xffffffff" edc:desc="EE Data Calibration Data" edc:factorydefault="0xffffffff" edc:impl="0xffffffff" edc:isidehidden="true" edc:name="DEVEE0" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x00000000">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="EECALDATA" edc:desc="EE Data Calibration Data" edc:isidehidden="true" edc:mask="0xffffffff" edc:name="EECALDATA" edc:nzwidth="0x20"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x1FC45034" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DEVEE1" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0xffffffff" edc:isidehidden="true" edc:name="DEVEE1" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x00000000">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="EECALDATA" edc:desc="EE Data Calibration Data" edc:isidehidden="true" edc:mask="0xffffffff" edc:name="EECALDATA" edc:nzwidth="0x20"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x1FC45038" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DEVEE2" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0xffffffff" edc:isidehidden="true" edc:name="DEVEE2" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x00000000">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="EECALDATA" edc:desc="EE Data Calibration Data" edc:isidehidden="true" edc:mask="0xffffffff" edc:name="EECALDATA" edc:nzwidth="0x20"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x1FC4503C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DEVEE3" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0xffffffff" edc:isidehidden="true" edc:name="DEVEE3" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x00000000">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="EECALDATA" edc:desc="EE Data Calibration Data" edc:isidehidden="true" edc:mask="0xffffffff" edc:name="EECALDATA" edc:nzwidth="0x20"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:ConfigFuseSector>
    <edc:GPRDataSector edc:beginaddr="0x00000000" edc:endaddr="0x00020000" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:ksegdef="1" edc:kuseg="0x0000000" edc:regionid="kseg0_data_mem"/>
    <edc:SFRDataSector edc:beginaddr="0x1f800000" edc:endaddr="0x1f802000" edc:kseg1="0xa0000000" edc:ksegdef="2" edc:regionid="periph_pb1_std">
      <edc:SFRDef edc:_addr="0x1F800000" edc:_begin="0x0" edc:_end="0x10" edc:_modsrc="DOS-02481_WACJ_MC_Config.Module" edc:_refcount="1" edc:access="-----n--nnnnnnnn--nnn---n---nn-n" edc:cname="CFGCON" edc:desc="" edc:impl="0x04ff388d" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----0--uuuuuu00--000---0---10-1" edc:name="CFGCON" edc:nzwidth="0x20" edc:por="-----0--xxxxxx00--000---0---10-1" edc:portals="- - -" ltx:baseofperipheral="CFG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TDOEN" edc:desc="" edc:mask="0x1" edc:name="TDOEN" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TROEN" edc:desc="" edc:mask="0x1" edc:name="TROEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="JTAGEN" edc:desc="" edc:mask="0x1" edc:name="JTAGEN" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="IOANCPEN" edc:mask="0x1" edc:name="IOANCPEN" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PGLOCK" edc:desc="" edc:mask="0x1" edc:name="PGLOCK" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PMDLOCK" edc:desc="" edc:mask="0x1" edc:name="PMDLOCK" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IOLOCK" edc:desc="" edc:mask="0x1" edc:name="IOLOCK" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="OCACLK" edc:desc="" edc:mask="0x1" edc:name="OCACLK" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ICACLK" edc:desc="" edc:mask="0x1" edc:name="ICACLK" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PWMAPIN1" edc:mask="0x1" edc:name="PWMAPIN1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWMAPIN2" edc:mask="0x1" edc:name="PWMAPIN2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWMAPIN3" edc:mask="0x1" edc:name="PWMAPIN3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWMAPIN4" edc:mask="0x1" edc:name="PWMAPIN4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWMAPIN5" edc:mask="0x1" edc:name="PWMAPIN5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWMAPIN6" edc:mask="0x1" edc:name="PWMAPIN6" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ADCPRI" edc:desc="" edc:mask="0x1" edc:name="ADCPRI" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F800010" edc:offset="16"/>
      <edc:SFRDef edc:_addr="0x1F800020" edc:_begin="0x20" edc:_end="0xb0" edc:_modsrc="DOS-02481_WACJ_MC_Config.Module" edc:_refcount="2" edc:access="rrrrnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DEVID" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000xxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="DEVID" edc:nzwidth="0x20" edc:por="0000xxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="- - -" ltx:memberofperipheral="CFG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DEVID" edc:desc="" edc:mask="0xfffffff" edc:name="DEVID" edc:nzwidth="28"/>
            <edc:SFRFieldDef edc:cname="VER" edc:desc="" edc:mask="0xf" edc:name="VER" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
