Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.0.39/edc/PIC32MK0512MCF064.PIC
      <edc:SFRDef edc:_addr="0x1F801300" edc:_begin="0xb0" edc:_end="0xc0" edc:_modsrc="DOS-02823_WACJ_clk_cru_upb_v2.Module" edc:_refcount="7" edc:access="--------------------r----nnnnnnn" edc:cname="PB1DIV" edc:desc="" edc:impl="0x87f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------------1----xxxxxxx" edc:name="PB1DIV" edc:nzwidth="32" edc:por="--------------------1----xxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CRU">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PBDIV" edc:desc="" edc:mask="0x7f" edc:name="PBDIV" edc:nzwidth="7"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="PBDIVRDY" edc:desc="" edc:mask="0x1" edc:name="PBDIVRDY" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="11"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801310" edc:_begin="0xb0" edc:_end="0xc0" edc:_modsrc="DOS-02823_WACJ_clk_cru_upb_v2.Module" edc:_refcount="8" edc:access="----------------n---r----nnnnnnn" edc:cname="PB2DIV" edc:desc="" edc:impl="0x887f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------1---1----xxxxxxx" edc:name="PB2DIV" edc:nzwidth="32" edc:por="----------------1---1----xxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PBDIV" edc:desc="" edc:mask="0x7f" edc:name="PBDIV" edc:nzwidth="7"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="PBDIVRDY" edc:desc="" edc:mask="0x1" edc:name="PBDIVRDY" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="11"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801320" edc:_begin="0xb0" edc:_end="0xc0" edc:_modsrc="DOS-02823_WACJ_clk_cru_upb_v2.Module" edc:_refcount="9" edc:access="----------------n---r----nnnnnnn" edc:cname="PB3DIV" edc:desc="" edc:impl="0x887f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------1---1----xxxxxxx" edc:name="PB3DIV" edc:nzwidth="32" edc:por="----------------1---1----xxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PBDIV" edc:desc="" edc:mask="0x7f" edc:name="PBDIV" edc:nzwidth="7"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="PBDIVRDY" edc:desc="" edc:mask="0x1" edc:name="PBDIVRDY" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="11"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801330" edc:_begin="0xb0" edc:_end="0xc0" edc:_modsrc="DOS-02823_WACJ_clk_cru_upb_v2.Module" edc:_refcount="10" edc:access="----------------n---r----nnnnnnn" edc:cname="PB4DIV" edc:desc="" edc:impl="0x887f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------1---1----xxxxxxx" edc:name="PB4DIV" edc:nzwidth="32" edc:por="----------------1---1----xxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PBDIV" edc:desc="" edc:mask="0x7f" edc:name="PBDIV" edc:nzwidth="7"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="PBDIVRDY" edc:desc="" edc:mask="0x1" edc:name="PBDIVRDY" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="11"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801340" edc:_begin="0xb0" edc:_end="0xc0" edc:_modsrc="DOS-02823_WACJ_clk_cru_upb_v2.Module" edc:_refcount="11" edc:access="----------------n---r----nnnnnnn" edc:cname="PB5DIV" edc:desc="" edc:impl="0x887f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------1---1----xxxxxxx" edc:name="PB5DIV" edc:nzwidth="32" edc:por="----------------1---1----xxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PBDIV" edc:desc="" edc:mask="0x7f" edc:name="PBDIV" edc:nzwidth="7"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="PBDIVRDY" edc:desc="" edc:mask="0x1" edc:name="PBDIVRDY" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="11"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801350" edc:_begin="0xb0" edc:_end="0xc0" edc:_modsrc="DOS-02823_WACJ_clk_cru_upb_v2.Module" edc:_refcount="12" edc:access="----------------n---r----nnnnnnn" edc:cname="PB6DIV" edc:desc="" edc:impl="0x887f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------1---1----xxxxxxx" edc:name="PB6DIV" edc:nzwidth="32" edc:por="----------------1---1----xxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PBDIV" edc:desc="" edc:mask="0x7f" edc:name="PBDIV" edc:nzwidth="7"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="PBDIVRDY" edc:desc="" edc:mask="0x1" edc:name="PBDIVRDY" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="11"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801360" edc:_begin="0xb0" edc:_end="0xc0" edc:_modsrc="DOS-02823_WACJ_clk_cru_upb_v2.Module" edc:_refcount="13" edc:access="----------------n---r----nnnnnnn" edc:cname="PB7DIV" edc:desc="" edc:impl="0x887f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------1---1----xxxxxxx" edc:name="PB7DIV" edc:nzwidth="32" edc:por="----------------1---1----xxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PBDIV" edc:desc="" edc:mask="0x7f" edc:name="PBDIV" edc:nzwidth="7"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="PBDIVRDY" edc:desc="" edc:mask="0x1" edc:name="PBDIVRDY" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="11"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F801370" edc:offset="0x10"/>
      <edc:SFRDef edc:_addr="0x1F801380" edc:_begin="0xc0" edc:_end="0xe0" edc:_modsrc="DOS-02823_WACJ_clk_cru_upb_v2.Module" edc:_refcount="14" edc:access="------------nnnn-----nnn-----nnn" edc:cname="SLEWCON" edc:desc="" edc:impl="0xf0707" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------0000-----000-----000" edc:name="SLEWCON" edc:nzwidth="32" edc:por="------------0000-----000-----000" edc:portals="CLR SET INV" ltx:memberofperipheral="CRU">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BUSY" edc:desc="" edc:mask="0x1" edc:name="BUSY" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DNEN" edc:desc="" edc:mask="0x1" edc:name="DNEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="UPEN" edc:desc="" edc:mask="0x1" edc:name="UPEN" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="SLWDIV" edc:mask="0x7" edc:name="SLWDIV" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="SYSDIV" edc:mask="0xf" edc:name="SYSDIV" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801390" edc:_begin="0xc0" edc:_end="0xe0" edc:_modsrc="DOS-02823_WACJ_clk_cru_upb_v2.Module" edc:_refcount="14" edc:access="-----------------------rr-rr-r-r" edc:cname="CLKSTAT" edc:desc="" edc:impl="0x1b5" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------------------uu-uu-u-u" edc:name="CLKSTAT" edc:nzwidth="32" edc:por="-----------------------00-00-0-0" edc:portals="CLR SET INV" ltx:memberofperipheral="CRU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FRCRDY" edc:mask="0x1" edc:name="FRCRDY" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="POSCRDY" edc:mask="0x1" edc:name="POSCRDY" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SOSCRDY" edc:mask="0x1" edc:name="SOSCRDY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LPRCRDY" edc:mask="0x1" edc:name="LPRCRDY" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SPLLRDY" edc:mask="0x1" edc:name="SPLLRDY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UPLLRDY" edc:mask="0x1" edc:name="UPLLRDY" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
