Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.0.39/edc/PIC32MK0512MCF064.PIC
      <edc:SFRDef edc:_addr="0x1F8016A8" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="36" edc:access="---------------------------nnnnn" edc:cname="RPC10R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPC10R" edc:nzwidth="0x20" edc:por="---------------------------00000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC10R" edc:desc="" edc:mask="0x1f" edc:name="RPC10R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8016AC" edc:offset="0x04"/>
      <edc:SFRDef edc:_addr="0x1F8016B0" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="37" edc:access="---------------------------nnnnn" edc:cname="RPC12R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPC12R" edc:nzwidth="0x20" edc:por="---------------------------00000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC12R" edc:desc="" edc:mask="0x1f" edc:name="RPC12R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8016B4" edc:offset="0x08"/>
      <edc:SFRDef edc:_addr="0x1F8016BC" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="38" edc:access="---------------------------nnnnn" edc:cname="RPC15R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPC15R" edc:nzwidth="0x20" edc:por="---------------------------00000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC15R" edc:desc="" edc:mask="0x1f" edc:name="RPC15R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8016C0" edc:offset="0x0c"/>
      <edc:SFRDef edc:_addr="0x1F8016CC" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="39" edc:access="---------------------------nnnnn" edc:cname="RPD3R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPD3R" edc:nzwidth="0x20" edc:por="---------------------------00000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPD3R" edc:desc="" edc:mask="0x1f" edc:name="RPD3R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8016D0" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="40" edc:access="---------------------------nnnnn" edc:cname="RPD4R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPD4R" edc:nzwidth="0x20" edc:por="---------------------------00000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPD4R" edc:desc="" edc:mask="0x1f" edc:name="RPD4R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8016D4" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="41" edc:access="---------------------------nnnnn" edc:cname="RPD5R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPD5R" edc:nzwidth="0x20" edc:por="---------------------------00000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPD5R" edc:desc="" edc:mask="0x1f" edc:name="RPD5R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8016D8" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="42" edc:access="---------------------------nnnnn" edc:cname="RPD6R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPD6R" edc:nzwidth="0x20" edc:por="---------------------------00000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPD6R" edc:desc="" edc:mask="0x1f" edc:name="RPD6R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8016DC" edc:offset="0x24"/>
      <edc:SFRDef edc:_addr="0x1F801700" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="43" edc:access="---------------------------nnnnn" edc:cname="RPE0R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPE0R" edc:nzwidth="0x20" edc:por="---------------------------00000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPE0R" edc:desc="" edc:mask="0x1f" edc:name="RPE0R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801704" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="44" edc:access="---------------------------nnnnn" edc:cname="RPE1R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPE1R" edc:nzwidth="0x20" edc:por="---------------------------00000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPE1R" edc:desc="" edc:mask="0x1f" edc:name="RPE1R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
