Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.0.39/edc/PIC32MK0512MCF064.PIC
      <edc:SFRDef edc:_addr="0x1F810380" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC36" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC36" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="AD1D38IS" edc:desc="" edc:mask="0x3" edc:name="AD1D38IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D38IP" edc:desc="" edc:mask="0x7" edc:name="AD1D38IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1D39IS" edc:desc="" edc:mask="0x3" edc:name="AD1D39IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D39IP" edc:desc="" edc:mask="0x7" edc:name="AD1D39IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1D40IS" edc:desc="" edc:mask="0x3" edc:name="AD1D40IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D40IP" edc:desc="" edc:mask="0x7" edc:name="AD1D40IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1D41IS" edc:desc="" edc:mask="0x3" edc:name="AD1D41IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D41IP" edc:desc="" edc:mask="0x7" edc:name="AD1D41IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810390" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:access="---nnnnn------------------------" edc:cname="IPC37" edc:impl="0xffe0e0e0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000------------------------" edc:name="IPC37" edc:nzwidth="32" edc:por="---00000------------------------" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="24"/>
            <edc:SFRFieldDef edc:cname="AD1D45IS" edc:desc="" edc:mask="0x3" edc:name="AD1D45IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D45IP" edc:desc="" edc:mask="0x7" edc:name="AD1D45IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8103A0" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC38" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC38" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="AD1D46IS" edc:desc="" edc:mask="0x3" edc:name="AD1D46IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D46IP" edc:desc="" edc:mask="0x7" edc:name="AD1D46IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1D47IS" edc:desc="" edc:mask="0x3" edc:name="AD1D47IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D47IP" edc:desc="" edc:mask="0x7" edc:name="AD1D47IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1D48IS" edc:desc="" edc:mask="0x3" edc:name="AD1D48IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D48IP" edc:desc="" edc:mask="0x7" edc:name="AD1D48IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1D49IS" edc:desc="" edc:mask="0x3" edc:name="AD1D49IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D49IP" edc:desc="" edc:mask="0x7" edc:name="AD1D49IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8103B0" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC39" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC39" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="AD1D50IS" edc:desc="" edc:mask="0x3" edc:name="AD1D50IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D50IP" edc:desc="" edc:mask="0x7" edc:name="AD1D50IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1D51IS" edc:desc="" edc:mask="0x3" edc:name="AD1D51IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D51IP" edc:desc="" edc:mask="0x7" edc:name="AD1D51IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1D52IS" edc:desc="" edc:mask="0x3" edc:name="AD1D52IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D52IP" edc:desc="" edc:mask="0x7" edc:name="AD1D52IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1D53IS" edc:desc="" edc:mask="0x3" edc:name="AD1D53IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D53IP" edc:desc="" edc:mask="0x7" edc:name="AD1D53IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8103C0" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:access="-----------nnnnn---nnnnn---nnnnn" edc:cname="IPC40" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------00000---00000---00000" edc:name="IPC40" edc:nzwidth="32" edc:por="-----------00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CMP3IS" edc:desc="" edc:mask="0x3" edc:name="CMP3IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CMP3IP" edc:desc="" edc:mask="0x7" edc:name="CMP3IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="CMP4IS" edc:desc="" edc:mask="0x3" edc:name="CMP4IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CMP4IP" edc:desc="" edc:mask="0x7" edc:name="CMP4IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="CMP5IS" edc:desc="" edc:mask="0x3" edc:name="CMP5IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CMP5IP" edc:desc="" edc:mask="0x7" edc:name="CMP5IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="8"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8103D0" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC41" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC41" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="U6EIS" edc:desc="" edc:mask="0x3" edc:name="U6EIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="U6EIP" edc:desc="" edc:mask="0x7" edc:name="U6EIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="U6RXIS" edc:desc="" edc:mask="0x3" edc:name="U6RXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="U6RXIP" edc:desc="" edc:mask="0x7" edc:name="U6RXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="U6TXIS" edc:desc="" edc:mask="0x3" edc:name="U6TXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="U6TXIP" edc:desc="" edc:mask="0x7" edc:name="U6TXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="CAN1IS" edc:desc="" edc:mask="0x3" edc:name="CAN1IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CAN1IP" edc:desc="" edc:mask="0x7" edc:name="CAN1IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
