Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.0.39/edc/PIC32MK0512MCF064.PIC
      <edc:SFRDef edc:_addr="0x1F82A300" edc:_begin="0xa0" edc:_end="0x1a0" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="4" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="PHASE3" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="PHASE3" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PHASE" edc:mask="0xffff" edc:name="PHASE" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F82A310" edc:_begin="0xa0" edc:_end="0x1a0" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="4" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="DTR3" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="DTR3" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DTR" edc:mask="0xffff" edc:name="DTR" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F82A320" edc:_begin="0xa0" edc:_end="0x1a0" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="4" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="ALTDTR3" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="ALTDTR3" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ALTDTR" edc:mask="0xffff" edc:name="ALTDTR" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F82A330" edc:_begin="0xa0" edc:_end="0x1a0" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="4" edc:access="------------------nnnnnnnnnnnnnn" edc:cname="DTCOMP3" edc:desc="" edc:impl="0x3fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------00000000000000" edc:name="DTCOMP3" edc:nzwidth="32" edc:por="------------------00000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="COMP" edc:mask="0x3fff" edc:name="COMP" edc:nzwidth="0xe"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F82A340" edc:_begin="0xa0" edc:_end="0x1a0" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="4" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="TRIG3" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="TRIG3" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TRGCMP" edc:mask="0xffff" edc:name="TRGCMP" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F82A350" edc:_begin="0xa0" edc:_end="0x1a0" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="4" edc:access="----------------nnnnnnnnnn------" edc:cname="TRGCON3" edc:desc="" edc:impl="0xffc0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000------" edc:name="TRGCON3" edc:nzwidth="32" edc:por="----------------0000000000------" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="STRGIS" edc:mask="0x1" edc:name="STRGIS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DTM" edc:mask="0x1" edc:name="DTM" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STRGSEL" edc:mask="0x3" edc:name="STRGSEL" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="TRGSEL" edc:mask="0x3" edc:name="TRGSEL" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="TRGDIV" edc:mask="0xf" edc:name="TRGDIV" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F82A360" edc:_begin="0xa0" edc:_end="0x1a0" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="4" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="STRIG3" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="STRIG3" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="STRGCMP" edc:mask="0xffff" edc:name="STRGCMP" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F82A370" edc:_begin="0xa0" edc:_end="0x1a0" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="4" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CAP3" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="CAP3" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CAP" edc:mask="0xffff" edc:name="CAP" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F82A380" edc:_begin="0xa0" edc:_end="0x1a0" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="4" edc:access="----------------nnnnnn----------" edc:cname="LEBCON3" edc:desc="" edc:impl="0xfc00" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------000000----------" edc:name="LEBCON3" edc:nzwidth="32" edc:por="----------------000000----------" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0xa"/>
            <edc:SFRFieldDef edc:cname="CLLEBEN" edc:mask="0x1" edc:name="CLLEBEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FLTLEBEN" edc:mask="0x1" edc:name="FLTLEBEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PLF" edc:mask="0x1" edc:name="PLF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PLR" edc:mask="0x1" edc:name="PLR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PHF" edc:mask="0x1" edc:name="PHF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PHR" edc:mask="0x1" edc:name="PHR" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
