Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.0.39/edc/PIC32MK0512MCF064.PIC
      <edc:SFRDef edc:_addr="0x1F82B6B0" edc:_begin="0x0" edc:_end="0xd0" edc:_modsrc="DOS-01494_qei_32b_upb_v1.Module" edc:_refcount="3" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="QEI3ICC" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="QEI3ICC" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="QEIICC" edc:mask="0xffffffff" edc:name="QEIICC" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F82B6C0" edc:_begin="0x0" edc:_end="0xd0" edc:_modsrc="DOS-01494_qei_32b_upb_v1.Module" edc:_refcount="3" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="QEI3CMPL" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="QEI3CMPL" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="QEICMPL" edc:mask="0xffffffff" edc:name="QEICMPL" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F82B6D0" edc:offset="0x130"/>
      <edc:SFRDef edc:_addr="0x1F82B800" edc:_begin="0x0" edc:_end="0xd0" edc:_modsrc="DOS-01494_qei_32b_upb_v1.Module" edc:_refcount="4" edc:access="----------------n-nnnnnn-nnnn-nn" edc:cname="QEI4CON" edc:desc="" edc:impl="0xbf7b" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0-000000-0000-00" edc:name="QEI4CON" edc:nzwidth="32" edc:por="----------------0-000000-0000-00" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CCM" edc:mask="0x3" edc:name="CCM" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="GATEN" edc:desc="" edc:mask="0x1" edc:name="GATEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNTPOL" edc:desc="" edc:mask="0x1" edc:name="CNTPOL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INTDIV" edc:desc="" edc:mask="0x7" edc:name="INTDIV" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="IMV" edc:desc="" edc:mask="0x3" edc:name="IMV" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="PIMOD" edc:desc="" edc:mask="0x7" edc:name="PIMOD" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="QEISIDL" edc:desc="" edc:mask="0x1" edc:name="QEISIDL" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="QEIEN" edc:desc="" edc:mask="0x1" edc:name="QEIEN" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F82B810" edc:_begin="0x0" edc:_end="0xd0" edc:_modsrc="DOS-01494_qei_32b_upb_v1.Module" edc:_refcount="4" edc:access="---------------nnnnnnnnnnnnnrrrr" edc:cname="QEI4IOC" edc:desc="" edc:impl="0x1ffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------0000000000000xxxx" edc:name="QEI4IOC" edc:nzwidth="32" edc:por="---------------0000000000000xxxx" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="QEA" edc:mask="0x1" edc:name="QEA" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="QEB" edc:mask="0x1" edc:name="QEB" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INDEX" edc:mask="0x1" edc:name="INDEX" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HOME" edc:mask="0x1" edc:name="HOME" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="QEAPOL" edc:mask="0x1" edc:name="QEAPOL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="QEBPOL" edc:mask="0x1" edc:name="QEBPOL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IDXPOL" edc:mask="0x1" edc:name="IDXPOL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HOMPOL" edc:mask="0x1" edc:name="HOMPOL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWPAB" edc:mask="0x1" edc:name="SWPAB" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OUTFNC" edc:mask="0x3" edc:name="OUTFNC" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="QFDIV" edc:mask="0x7" edc:name="QFDIV" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="FLTREN" edc:mask="0x1" edc:name="FLTREN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="QCAPEN" edc:mask="0x1" edc:name="QCAPEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HCAPEN" edc:mask="0x1" edc:name="HCAPEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F82B820" edc:_begin="0x0" edc:_end="0xd0" edc:_modsrc="DOS-01494_qei_32b_upb_v1.Module" edc:_refcount="4" edc:access="------------------nnnnnnnnnnnnnn" edc:cname="QEI4STAT" edc:desc="" edc:impl="0x3fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------00000000000000" edc:name="QEI4STAT" edc:nzwidth="32" edc:por="------------------00000000000000" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IDXIEN" edc:mask="0x1" edc:name="IDXIEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IDXIRQ" edc:mask="0x1" edc:name="IDXIRQ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HOMIEN" edc:mask="0x1" edc:name="HOMIEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HOMIRQ" edc:mask="0x1" edc:name="HOMIRQ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VELOVIEN" edc:mask="0x1" edc:name="VELOVIEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VELOVIRQ" edc:mask="0x1" edc:name="VELOVIRQ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCIIEN" edc:mask="0x1" edc:name="PCIIEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCIIRQ" edc:mask="0x1" edc:name="PCIIRQ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="POSOVIEN" edc:mask="0x1" edc:name="POSOVIEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="POSOVIRQ" edc:mask="0x1" edc:name="POSOVIRQ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCLEQIEN" edc:mask="0x1" edc:name="PCLEQIEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCLEQIRQ" edc:mask="0x1" edc:name="PCLEQIRQ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCHEQIEN" edc:mask="0x1" edc:name="PCHEQIEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCHEQIRQ" edc:mask="0x1" edc:name="PCHEQIRQ" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
