Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.0.39/edc/PIC32MK0512MCF064.PIC
      <edc:SFRDef edc:_addr="0x1F860410" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="5" edc:access="----------------nnnn------------" edc:cname="TRISE" edc:desc="" edc:grp="PORTE" edc:impl="0xfffff000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------1111------------" edc:name="TRISE" edc:nzwidth="0x20" edc:por="----------------1111------------" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TRISE12" edc:desc="" edc:mask="0x1" edc:name="TRISE12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISE13" edc:desc="" edc:mask="0x1" edc:name="TRISE13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISE14" edc:desc="" edc:mask="0x1" edc:name="TRISE14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISE15" edc:desc="" edc:mask="0x1" edc:name="TRISE15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x0" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860420" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="5" edc:access="----------------nnnn------------" edc:cname="PORTE" edc:desc="" edc:grp="PORTE" edc:impl="0xfffff000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxx------------" edc:name="PORTE" edc:nzwidth="0x20" edc:por="----------------xxxx------------" edc:portals="CLR SET INV" ltx:baseofperipheral="PORTE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RE12" edc:desc="" edc:mask="0x1" edc:name="RE12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RE13" edc:desc="" edc:mask="0x1" edc:name="RE13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RE14" edc:desc="" edc:mask="0x1" edc:name="RE14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RE15" edc:desc="" edc:mask="0x1" edc:name="RE15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x0" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860430" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="5" edc:access="----------------nnnn------------" edc:cname="LATE" edc:desc="" edc:grp="PORTE" edc:impl="0xfffff000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxx------------" edc:name="LATE" edc:nzwidth="0x20" edc:por="----------------xxxx------------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="LATE12" edc:desc="" edc:mask="0x1" edc:name="LATE12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATE13" edc:desc="" edc:mask="0x1" edc:name="LATE13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATE14" edc:desc="" edc:mask="0x1" edc:name="LATE14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATE15" edc:desc="" edc:mask="0x1" edc:name="LATE15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x0" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860440" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="5" edc:access="----------------nnnn------------" edc:cname="ODCE" edc:desc="" edc:grp="PORTE" edc:impl="0xfffff000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000------------" edc:name="ODCE" edc:nzwidth="0x20" edc:por="----------------0000------------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ODCE12" edc:desc="" edc:mask="0x1" edc:name="ODCE12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCE13" edc:desc="" edc:mask="0x1" edc:name="ODCE13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCE14" edc:desc="" edc:mask="0x1" edc:name="ODCE14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCE15" edc:desc="" edc:mask="0x1" edc:name="ODCE15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x0" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860450" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="5" edc:access="----------------nnnn------------" edc:cname="CNPUE" edc:desc="" edc:grp="PORTE" edc:impl="0xfffff000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000------------" edc:name="CNPUE" edc:nzwidth="0x20" edc:por="----------------0000------------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPUE12" edc:desc="" edc:mask="0x1" edc:name="CNPUE12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE13" edc:desc="" edc:mask="0x1" edc:name="CNPUE13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE14" edc:desc="" edc:mask="0x1" edc:name="CNPUE14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE15" edc:desc="" edc:mask="0x1" edc:name="CNPUE15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x0" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860460" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="5" edc:access="----------------nnnn------------" edc:cname="CNPDE" edc:desc="" edc:grp="PORTE" edc:impl="0xfffff000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000------------" edc:name="CNPDE" edc:nzwidth="0x20" edc:por="----------------0000------------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPDE12" edc:desc="" edc:mask="0x1" edc:name="CNPDE12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDE13" edc:desc="" edc:mask="0x1" edc:name="CNPDE13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDE14" edc:desc="" edc:mask="0x1" edc:name="CNPDE14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDE15" edc:desc="" edc:mask="0x1" edc:name="CNPDE15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x0" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860470" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="5" edc:access="----------------n---n-----------" edc:cname="CNCONE" edc:desc="" edc:grp="PORTE" edc:impl="0xffff9fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0---0-----------" edc:name="CNCONE" edc:nzwidth="0x20" edc:por="----------------0---0-----------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0xb"/>
            <edc:SFRFieldDef edc:cname="EDGEDETECT" edc:mask="0x1" edc:name="EDGEDETECT" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="CHANGE NOTICE E" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860480" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="5" edc:access="----------------nnnn------------" edc:cname="CNENE" edc:desc="" edc:grp="PORTE" edc:impl="0xffc0f000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000------------" edc:name="CNENE" edc:nzwidth="0x20" edc:por="----------------0000------------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNIEE12" edc:desc="" edc:mask="0x1" edc:name="CNIEE12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEE13" edc:desc="" edc:mask="0x1" edc:name="CNIEE13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEE14" edc:desc="" edc:mask="0x1" edc:name="CNIEE14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEE15" edc:desc="" edc:mask="0x1" edc:name="CNIEE15" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x0" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860490" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="5" edc:access="----------------nnnn------------" edc:cname="CNSTATE" edc:desc="" edc:grp="PORTE" edc:impl="0xfffff000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000------------" edc:name="CNSTATE" edc:nzwidth="0x20" edc:por="----------------0000------------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNSTATE12" edc:desc="" edc:mask="0x1" edc:name="CNSTATE12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATE13" edc:desc="" edc:mask="0x1" edc:name="CNSTATE13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATE14" edc:desc="" edc:mask="0x1" edc:name="CNSTATE14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATE15" edc:desc="" edc:mask="0x1" edc:name="CNSTATE15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x0" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8604A0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="5" edc:access="----------------nnnn------------" edc:cname="CNNEE" edc:desc="" edc:impl="0xf000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000------------" edc:name="CNNEE" edc:nzwidth="32" edc:por="----------------0000------------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNNEE12" edc:mask="0x1" edc:name="CNNEE12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEE13" edc:mask="0x1" edc:name="CNNEE13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEE14" edc:mask="0x1" edc:name="CNNEE14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEE15" edc:mask="0x1" edc:name="CNNEE15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
